axibump/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    0.2032;

vertices
(
    (-3.2             0.375 0)    // 0
    (-0.2                0.375 0)     // 1
    (1.4                0.375 0)     // 2
    (4.4              0.375 0)     // 3
    (-3.2             4 0)    // 4
    (-0.2                4 0)     // 5
    (1.4                4 0)     // 6
    (4.4              4 0)     // 7



    (-3.2             0.375 1)    // 8    
    (-0.2                0.375 1)     // 9
    (1.4                0.375 1)     // 10
    (4.4                0.375 1)     // 11
    (-3.2             4 1)    // 12
    (-0.2                4 1)     // 13
    (1.4                4 1)     // 14
    (4.4              4 1)     // 15
);
//((0.5 0.5 0.5)(0.5 0.5 1))
blocks
(
    hex (0 1 5 4 8 9 13 12) (30 100 1) simpleGrading (0.05 1000 1)
    hex (1 2 6 5 9 10 14 13) (500 100 1) simpleGrading (((0.5 0.5 0.05)(0.5 0.5 20)) 1000 1)
    hex (2 3 7 6 10 11 15 14) (40 100 1) simpleGrading (25 1000 1)
);

edges
(

        polyLine 1 2
        (
(-0.143436700100000	0.375007003500000	0)
(-0.0966374874100000	0.376406192800000	0)
(-0.0522243902100000	0.379989892200000	0)
(-0.0100757200300000	0.385446697500000	0)
(0.0299239698800000	0.392510801600000	0)
(0.0678842589300000	0.400953590900000	0)
(0.103909097600000	0.410577595200000	0)
(0.138097196800000	0.420466899900000	0)
(0.170542195400000	0.428859502100000	0)
(0.201333001300000	0.436053812500000	0)
(0.230553895200000	0.442198395700000	0)
(0.258284896600000	0.447423309100000	0)
(0.284602105600000	0.451841712000000	0)
(0.309577494900000	0.455553293200000	0)
(0.333279490500000	0.458645403400000	0)
(0.355773001900000	0.461194992100000	0)
(0.377119690200000	0.463270008600000	0)
(0.397377997600000	0.464930295900000	0)
(0.416603386400000	0.466228604300000	0)
(0.434848606600000	0.467211693500000	0)
(0.452163606900000	0.467920899400000	0)
(0.468595713400000	0.468392700000000	0)
(0.484189987200000	0.468659490300000	0)
(0.498989313800000	0.468749612600000	0)
(0.513033986100000	0.468688488000000	0)
(0.526362597900000	0.468498289600000	0)
(0.539011716800000	0.468198686800000	0)
(0.551015794300000	0.467806994900000	0)
(0.562407970400000	0.467338591800000	0)
(0.573219180100000	0.466806888600000	0)
(0.583479285200000	0.466223597500000	0)
(0.593216180800000	0.465599089900000	0)
(0.602456688900000	0.464942604300000	0)
(0.611226081800000	0.464261800100000	0)
(0.619548320800000	0.463563799900000	0)
(0.627446174600000	0.462854296000000	0)
(0.634941518300000	0.462138801800000	0)
(0.642054617400000	0.461421489700000	0)
(0.648805022200000	0.460706412800000	0)
(0.655211329500000	0.459996610900000	0)
(0.661290884000000	0.459295094000000	0)
(0.667060613600000	0.458604008000000	0)
(0.672536075100000	0.457925289900000	0)
(0.677732408000000	0.457260698100000	0)
(0.682663798300000	0.456611394900000	0)
(0.687343776200000	0.455978512800000	0)
(0.691785097100000	0.455362796800000	0)
(0.695999980000000	0.454764902600000	0)
(0.699999988100000	0.454185098400000	0)
(0.703999996200000	0.453593403100000	0)
(0.708000004300000	0.452989786900000	0)
(0.712138414400000	0.452352613200000	0)
(0.716419875600000	0.451679796000000	0)
(0.720849573600000	0.450969308600000	0)
(0.725432515100000	0.450218588100000	0)
(0.730174005000000	0.449425309900000	0)
(0.735079526900000	0.448586702300000	0)
(0.740154683600000	0.447699785200000	0)
(0.745405495200000	0.446761697500000	0)
(0.750837981700000	0.445769190800000	0)
(0.756458401700000	0.444718599300000	0)
(0.762273192400000	0.443606197800000	0)
(0.768289208400000	0.442428201400000	0)
(0.774513423400000	0.441180110000000	0)
(0.780952811200000	0.439857512700000	0)
(0.787615120400000	0.438455492300000	0)
(0.794507801500000	0.436968714000000	0)
(0.801639020400000	0.435391694300000	0)
(0.809016883400000	0.433718413100000	0)
(0.816649973400000	0.431942403300000	0)
(0.824547171600000	0.430056810400000	0)
(0.832717597500000	0.428054094300000	0)
(0.841170728200000	0.425926506500000	0)
(0.849916279300000	0.423665404300000	0)
(0.858964324000000	0.421261698000000	0)
(0.868325412300000	0.418705403800000	0)
(0.878010392200000	0.415986090900000	0)
(0.888030409800000	0.413092285400000	0)
(0.898397088100000	0.410011798100000	0)
(0.909122407400000	0.406731307500000	0)
(0.920218825300000	0.403236597800000	0)
(0.931698977900000	0.399512499600000	0)
(0.943576395500000	0.395542204400000	0)
(0.955864787100000	0.391307890400000	0)
(0.968578219400000	0.386790096800000	0)
(0.981731474400000	0.382197409900000	0)
(0.995339810800000	0.378575593200000	0)
(1.00941896400000	0.376174807500000	0)
)

        polyLine 9 10
        (
(-0.143436700100000	0.375007003500000	1)
(-0.0966374874100000	0.376406192800000	1)
(-0.0522243902100000	0.379989892200000	1)
(-0.0100757200300000	0.385446697500000	1)
(0.0299239698800000	0.392510801600000	1)
(0.0678842589300000	0.400953590900000	1)
(0.103909097600000	0.410577595200000	1)
(0.138097196800000	0.420466899900000	1)
(0.170542195400000	0.428859502100000	1)
(0.201333001300000	0.436053812500000	1)
(0.230553895200000	0.442198395700000	1)
(0.258284896600000	0.447423309100000	1)
(0.284602105600000	0.451841712000000	1)
(0.309577494900000	0.455553293200000	1)
(0.333279490500000	0.458645403400000	1)
(0.355773001900000	0.461194992100000	1)
(0.377119690200000	0.463270008600000	1)
(0.397377997600000	0.464930295900000	1)
(0.416603386400000	0.466228604300000	1)
(0.434848606600000	0.467211693500000	1)
(0.452163606900000	0.467920899400000	1)
(0.468595713400000	0.468392700000000	1)
(0.484189987200000	0.468659490300000	1)
(0.498989313800000	0.468749612600000	1)
(0.513033986100000	0.468688488000000	1)
(0.526362597900000	0.468498289600000	1)
(0.539011716800000	0.468198686800000	1)
(0.551015794300000	0.467806994900000	1)
(0.562407970400000	0.467338591800000	1)
(0.573219180100000	0.466806888600000	1)
(0.583479285200000	0.466223597500000	1)
(0.593216180800000	0.465599089900000	1)
(0.602456688900000	0.464942604300000	1)
(0.611226081800000	0.464261800100000	1)
(0.619548320800000	0.463563799900000	1)
(0.627446174600000	0.462854296000000	1)
(0.634941518300000	0.462138801800000	1)
(0.642054617400000	0.461421489700000	1)
(0.648805022200000	0.460706412800000	1)
(0.655211329500000	0.459996610900000	1)
(0.661290884000000	0.459295094000000	1)
(0.667060613600000	0.458604008000000	1)
(0.672536075100000	0.457925289900000	1)
(0.677732408000000	0.457260698100000	1)
(0.682663798300000	0.456611394900000	1)
(0.687343776200000	0.455978512800000	1)
(0.691785097100000	0.455362796800000	1)
(0.695999980000000	0.454764902600000	1)
(0.699999988100000	0.454185098400000	1)
(0.703999996200000	0.453593403100000	1)
(0.708000004300000	0.452989786900000	1)
(0.712138414400000	0.452352613200000	1)
(0.716419875600000	0.451679796000000	1)
(0.720849573600000	0.450969308600000	1)
(0.725432515100000	0.450218588100000	1)
(0.730174005000000	0.449425309900000	1)
(0.735079526900000	0.448586702300000	1)
(0.740154683600000	0.447699785200000	1)
(0.745405495200000	0.446761697500000	1)
(0.750837981700000	0.445769190800000	1)
(0.756458401700000	0.444718599300000	1)
(0.762273192400000	0.443606197800000	1)
(0.768289208400000	0.442428201400000	1)
(0.774513423400000	0.441180110000000	1)
(0.780952811200000	0.439857512700000	1)
(0.787615120400000	0.438455492300000	1)
(0.794507801500000	0.436968714000000	1)
(0.801639020400000	0.435391694300000	1)
(0.809016883400000	0.433718413100000	1)
(0.816649973400000	0.431942403300000	1)
(0.824547171600000	0.430056810400000	1)
(0.832717597500000	0.428054094300000	1)
(0.841170728200000	0.425926506500000	1)
(0.849916279300000	0.423665404300000	1)
(0.858964324000000	0.421261698000000	1)
(0.868325412300000	0.418705403800000	1)
(0.878010392200000	0.415986090900000	1)
(0.888030409800000	0.413092285400000	1)
(0.898397088100000	0.410011798100000	1)
(0.909122407400000	0.406731307500000	1)
(0.920218825300000	0.403236597800000	1)
(0.931698977900000	0.399512499600000	1)
(0.943576395500000	0.395542204400000	1)
(0.955864787100000	0.391307890400000	1)
(0.968578219400000	0.386790096800000	1)
(0.981731474400000	0.382197409900000	1)
(0.995339810800000	0.378575593200000	1)
(1.00941896400000	0.376174807500000	1)



)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 15 11)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 12 13 5)
            (5 13 14 6)
            (6 14 15 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (8 9 13 12)
            (9 10 14 13)
            (10 11 15 14)
            (1 0 4 5)
            (2 1 5 6)
            (3 2 6 7)
        );
    }
);

