axibump/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       113330;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       113430;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          570;
        startFace       113530;
    }
    upperWall
    {
        type            patch;
        nFaces          570;
        startFace       114100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          114000;
        startFace       114670;
    }
)

// ************************************************************************* //
